Revit 2027 API
OrdinateOriginVisibility Enumeration
 The ordinate origin visibility.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum OrdinateOriginVisibility
Public Enumeration OrdinateOriginVisibility
public enum class OrdinateOriginVisibility
type OrdinateOriginVisibility
Members
Member name | Value | Description
None | 0 |  Does not show the origin witness line, tick mark, or text (0'-0").
WitnessLineOnly | 2 |  Shows the origin witness line and tick mark.
WitnessLineWithText | 1 |  Shows the origin witness line, tick mark and text (0'-0").
See Also
Reference
Autodesk.Revit.DB Namespace